; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	spectrograph1 - mode
	thermograph6 - mode
	image5 - mode
	spectrograph3 - mode
	thermograph2 - mode
	spectrograph7 - mode
	infrared0 - mode
	infrared4 - mode
	Star0 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	Star2 - direction
	GroundStation1 - direction
	Star4 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 spectrograph7)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph2)
	(supports instrument1 spectrograph1)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument2 spectrograph7)
	(supports instrument2 thermograph2)
	(supports instrument2 infrared4)
	(supports instrument2 image5)
	(supports instrument2 thermograph6)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon9)
)
(:goal (and
	(pointing satellite1 Phenomenon9)
	(have_image Planet6 thermograph6)
	(have_image Planet6 infrared0)
	(have_image Phenomenon7 spectrograph7)
	(have_image Planet8 infrared0)
	(have_image Phenomenon9 thermograph6)
	(have_image Phenomenon9 infrared4)
	(have_image Star10 spectrograph1)
	(have_image Star10 thermograph6)
))

)

; plan
1. (turn_to satellite1 groundstation1 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 9
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 9
3. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 0 of 9
4. (turn_to satellite1 phenomenon7 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon7)
   goals met: 0 of 9
5. (turn_to satellite0 star2 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star2)
   goals met: 0 of 9
6. (take_image satellite1 phenomenon7 instrument2 spectrograph7)
   added: (have_image phenomenon7 spectrograph7)
   goals met: 1 of 9
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 9
8. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 1 of 9
9. (turn_to satellite0 planet6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet6)
   goals met: 1 of 9
10. (take_image satellite0 planet6 instrument0 infrared0)
   added: (have_image planet6 infrared0)
   goals met: 2 of 9
11. (turn_to satellite0 planet8 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet8)
   goals met: 2 of 9
12. (take_image satellite0 planet8 instrument0 infrared0)
   added: (have_image planet8 infrared0)
   goals met: 3 of 9
13. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 3 of 9
14. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 9
15. (turn_to satellite0 star2 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star2)
   goals met: 3 of 9
16. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 3 of 9
17. (turn_to satellite0 star10 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star10)
   goals met: 3 of 9
18. (take_image satellite0 star10 instrument1 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 4 of 9
19. (turn_to satellite1 planet6 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet6)
   goals met: 4 of 9
20. (take_image satellite1 planet6 instrument2 thermograph6)
   added: (have_image planet6 thermograph6)
   goals met: 5 of 9
21. (turn_to satellite1 star10 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star10)
   goals met: 5 of 9
22. (take_image satellite1 star10 instrument2 thermograph6)
   added: (have_image star10 thermograph6)
   goals met: 6 of 9
23. (turn_to satellite1 phenomenon9 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 phenomenon9)
   goals met: 7 of 9
24. (take_image satellite1 phenomenon9 instrument2 infrared4)
   added: (have_image phenomenon9 infrared4)
   goals met: 8 of 9
25. (take_image satellite1 phenomenon9 instrument2 thermograph6)
   added: (have_image phenomenon9 thermograph6)
   goals met: 9 of 9
